---
kind: other
id: Methods.T:Autodesk.Revit.DB.ExternalResourceServiceUtils
source: html/8adf4234-756b-c99b-a914-3c012e30b9ad.htm
---
# ExternalResourceServiceUtils Methods

Gets registered external resource servers which support the external resource type.